export default [
  {
    name: "ニュービー",
    icon: "🐣",
    summary: "プログラミングに興味を持って簡単な入門サイトでプログラミングを勉強した",
    abilities: [
      "基本的な文法の意味がわかる・かける(変数や制御構文)",
      "関数のざっくりとした理解",
      "クラスのざっくりとした理解",
    ],
  },
  {
    name: "ビギナー",
    icon: "🥺",
    summary: "公式チュートリアルや本、動画で少し深く学習を進めてきた",
    abilities: [
      "シンプルなサービスの開発をカリキュラム見ながらだったら構築できる",
      "コピペでなんとか機能開発ができる",
      "配列や連想配列をある程度思ったように使える",
      "簡単なUnix系コマンドを知っている",
      "フレームワークの基本的な使い方を知っている",
      "ブログサイトくらいなら作れる",
      "Herokuだったら記事を見ながらデプロイできる",
      "gitやGithubについてもざっくり知っている",
    ],
  },
  {
    name: "ジュニア",
    icon: "😁",
    summary: "チケット単位で簡単な仕事だったらこなせる",
    abilities: [
      "gitやGithubをつかって開発を進められる",
      "カリキュラムにないライブラリも自分で調べて使える",
      "自分でサービスの企画からコードを組み立てられる",
      "Unix系システムの基本的な理解(ファイルシステム, コマンド操作)",
      "サーバーにリモートログインして環境構築できる",
      "他人のコードを読んでシステムフローがある程度理解できる",
      "テストがかける",
      "一人である程度デバッグできる",
    ],
  },
];
